Resources/Test/sample_soap.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soapenv:Header>
    <wsa:To>
    http://localhost:8080/IBM-Initiate-IHE/services/PDQSupplier</wsa:To>
    <wsa:Action mustUnderstand="1">
    urn:hl7-org:v3:PRPA_IN201305UV02</wsa:Action>
    <wsa:MessageID>1</wsa:MessageID>
  </soapenv:Header>
  <soapenv:Body>
    <PRPA_IN201301UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3">
      <id root="1.2.3.4.5" />
      <creationTime value="201001121736" />
      <interactionId displayable="true"
      extension="PRPA_IN201301UV02" root="2.16.840.1.18" />
      <processingCode code="P" />
      <processingModeCode code="R" />
      <acceptAckCode code="AL" />
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.3.6.1.4.1.21367.2010.1.3.4.630" />
          <name>INIT</name>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="1.3.6.1.4.1.21367.2010.1.3.3.399" />
          <name>NA10</name>
        </device>
      </sender>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_IN201301UV" />
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <id extension="10501N17" root="1.2.3.4.5" />
            <statusCode code="active" />
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id extension="11805" root="1.2" />
                <statusCode code="active" />
                <patientPerson classCode="PSN"
                determinerCode="INSTANCE">
                  <name>
                    <family>miller</family>
                    <given>harold</given>
                  </name>
                  <administrativeGenderCode code="M" />
                  <birthTime value="19460201" />
                  <addr>
                    <streetAddressLine>723 Oak
                    St</streetAddressLine>
                    <city>Atlanta</city>
                    <state>GA</state>
                    <postalCode>30341</postalCode>
                  </addr>
                </patientPerson>
                <providerOrganization>
                  <id root="1.3.6.1.4.1.21367.2010.1.2.300" />
                  <name>XDSDEMO_ADT</name>
                </providerOrganization>
              </patient>
            </subject1>
          </registrationEvent>
        </subject>
      </controlActProcess>
    </PRPA_IN201301UV02>
  </soapenv:Body>
</soapenv:Envelope>
